using eBookstore.model;
using System;
using System.Collections.Generic;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace eBookstore.data
{
    class BookList
    {
        public Book[] Data { get; } =
        {
            new Book() {
                Cover=Properties.Resources.book_1,
                Title="Ανάπτυξη Εφαρμογών σε Προγραμματιστικό Περιβάλλον Γ΄ Λυκείου-Θετικών Σπουδών",
                Summary="Το μάθημα για την Ανάπτυξη Εφαρμογών σε Προγραμματιστικό Περιβάλλον έχει ως σκοπό να αναπτύ­ξουν οι μαθητές αναλυτική και συνθετική σκέψη, να αποκτήσουν ικανότητες μεθοδολογικού χαρακτήρα και να μπορούν να επιλύουν απλά προβλήματα σε προγραμματιστικό περιβάλλον. Το μάθημα έχει ως πρωταρχικό στόχο την ανάπτυξη δεξιοτήτων και ικανοτήτων σχετικών με την αλγοριθμική και την ορθολογική τους χρήση στην καθημερινή ζωή. Πολλές βασικές έννοιες αλγοριθμικής αλλά και προγραμματισμού συνιστούν αναπόσπαστο τμήμα των γενικών γνώσεων και δεξιοτήτων που πρέπει να αποκτήσει ο μαθητής.",
                Author="Συλλογικό έργο",
                Publisher="Ινστιτούτο Τεχνολογίας Υπολογιστών και Εκδόσεων Διόφαντος",
                PublishedDate=DateTime.Now,
                BasePrice=6.52,
                Discount=0.0
            },
            new Book() {
                Cover=Properties.Resources.book_2,
                Title="Χημεία Γ' Λυκείου-Θετικών Σπουδών ",
                Summary="Να περιγράφουν το ατομικό πρότυπο του Bohr και το κβαντομηχανική πρότυπο του ατόμου και να συνδέουν την ηλεκτρονιακή δόμηση με την κατάταξη των στοιχείων στον περιοδικό πίνακα. Να διακρίνουν την περιοδική τάση των στοιχειών από το Na έως το Ar (3η περίοδος), και να αιτιολογούν τις χαρακτηριστικές ιδιότητες των στοιχείων μεταπτώσεως. Να ορίζουν θεμελιώδη χαρακτηριστικά του ατόμου. Να γράφουν τους ηλεκτρονιακούς τύπους κατά Lewis καθαρών ουσιών. Να αναπτύσσουν τη θεωρία VSEPR και να περιγράφουν με βάση αυτή τη γεωμετρία ορισμένων μορίων.",
                Author="Συλλογικό έργο",
                Publisher="Ινστιτούτο Τεχνολογίας Υπολογιστών και Εκδόσεων Διόφαντος",
                PublishedDate=DateTime.Now,
                BasePrice=6.14,
                Discount=10.0
            },
            new Book() {
                Cover=Properties.Resources.book_3,
                Title="Κείμενα Νεοελληνικής Λογοτεχνίας Γ' Γενικού Λυκείου Τεύχος",
                Summary="Στα Κείμενα Νεοελληνικής Λογοτεχνίας της Γ΄ Λυκείου μελετώνται έργα των λεγόμενων μεταπολεμικών ποιητών και των νεότερων λογοτεχνών. Οι μεταπολεμικοί ποιητές εμφανίζονται στα πρώτα χρόνια της Κατοχής και χωρίζονται σε δύο γενιές. Στην πρώτη γενιά συμπεριλαμβάνονται όσοι ενηλικιώθηκαν από το 1918 ώς το 1928, ενώ στη δεύτερη γενιά συμπεριλαμβάνονται όσοι εξέδωσαν την πρώτη ποιητική τους συλλογή τη δεκαετία 1955-1965. Οι δύο γενιές μεταπολεμικών ποιητών παρουσιάζουν σημαντικές διαφορές μεταξύ τους, οι οποίες επικεντρώνονται κυρίως στη σχέση που έχουν οι γενιές αυτές με την ιστορική συνθήκη κατά τη διάρκεια της οποίας ζουν. Το βιβλίο επίσης περιέχει πεζογραφήματα που ανήκουν στη μεταπολεμική περίοδο (1945-1974). Οι μεταπολεμικοί πεζογράφοι έχουν κοινό σημείο αναφοράς την κρίσιμη δεκαετία του 1940 και τα χρόνια μετά το τέλος της Κατοχής και του Εμφυλίου. Οι μεταπολεμικοί πεζογράφοι έχουν κοινή συνείδηση ότι διαφέρουν από τους προηγούμενους, ενώ οι μεταπολεμικοί ποιητές βρίσκουν στους προηγούμενους τα εργαλεία για να μιλήσουν για αυτό το οποίο τους απασχολεί. Η μεταπολεμική λογοτεχνία στο σύνολό της επιχειρεί να σκιαγραφήσει τα δύσκολα χρόνια μετά το τέλος του Β΄ Παγκοσμίου πολέμου και τις ραγδαίες πολιτικοκοινωνικές εξελίξεις μετά το τέλος του πολέμου. Τα δοκίμια που συμπεριλαμβάνονται στο βιβλίο εξετάζουν τις συνθήκες της λογοτεχνικής παραγωγής και πώς η πραγματικότητα επηρεάζει όχι μόνο τη λογοτεχνική παραγωγή αλλά και την πρόσληψή της από το αναγνωστικό κοινό. Παράλληλα, μελετώνται έργα-σταθμοί της ξένης λογοτεχνίας, τα οποία επιδεικνύουν όχι μόνο τις ποικίλες τάσεις της παγκόσμιας λογοτεχνικής παραγωγής αλλά και την άρρηκτη σύνδεση της ιστορικής πραγματικότητας και της λογοτεχνικής δημιουργίας",
                Author="Συλλογικό έργο",
                Publisher="Ινστιτούτο Τεχνολογίας Υπολογιστών και Εκδόσεων Διόφαντος",
                PublishedDate=DateTime.Now,
                BasePrice=6.36,
                Discount=10.0
            },
        };
    }
}
