using eBookstore.model;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Windows.Forms;

namespace eBookstore.data
{
    class BookList
    {
        public List<Book> Data { get; set;  }

        public AutoCompleteStringCollection AutoCompleteTerms { get; set; }

        public BookList()
        {
            this.InitializeBooks();

            this.InitializeAutoCompleteTerms();
        }

        private void InitializeBooks()
        {
            this.Data = new List<Book>();

            this.Data.Add(new Book()
            {
                Cover = Properties.Resources.book_1,
                Title = "Εισαγωγή στην Πολιτισμική Ανθρωπολογία",
                Summary = "Το βιβλίο αυτό αποτελεί ένα περιεκτικό πρώτο µέρος µιας µαθητείας στην Πολιτισµική Ανθρωπολογία στο πλαίσιο της διεπιστηµονικής προσέγγισης. Στόχος του είναι να εµπλέξει τους νεαρούς µελετητές και σπουδαστές σε έναν κριτικό διάλογο µε τις παλαιότερες και τις σύγχρονες κατευθύνσεις στις πολιτισµικές-ιστορικές σπουδές· ειδικότερα δε, να εισαγάγει τους επίδοξους ανθρωπολόγους καθώς και τους αναγνώστες που ενδιαφέρονται για τις ανθρώπινες κουλτούρες σε βασικές εθνογραφικές αρχές, θεωρητικές και µεθοδολογικές, ώστε να εµβαθύνουν στην ιδιαίτερη πολιτισµική ανθρωπολογική άποψη και προοπτική.",
                Category = "Κοινωνιολογία",
                Author = "Σερεμετάκη Κωνσταντίνα - Νάντια",
                Pages = 336,
                Publisher = "Πεδίο",
                YearPublished = 2017,
                ISBN = "9789605467784",
                BasePrice = 15.33,
                Discount = 30.0
            });

            this.Data.Add(new Book()
            {
                Cover = Properties.Resources.book_2,
                Title = "Η θεωρία των ηθικών συναισθημάτων",
                Summary = "Μέχρι το τελευταίο τέταρτο του 20ού αιώνα το γεγονός ότι ο πατέρας της πολιτικής οικονομίας είχε γράψει και ένα έργο ηθικής φιλοσοφίας αποτελούσε πηγή αμηχανίας ή αντιμετωπιζόταν, με ελάχιστες εξαιρέσεις, ως μια δευτερεύουσα υποσημείωση στην ιστορία των οικονομικών ιδεών. Η επιτυχία και η συνακόλουθη ειδωλοποίηση του οικονομικού έργου έριχνε βαριά τη σκιά της στην αξιολόγηση του φιλοσοφικού. Ωστόσο με την πρόσφατη αναζωπύρωση της διεθνούς συζήτησης για τον Adam Smith και τον σκωτικό Διαφωτισμό γενικότερα, δεν έπαψε να κερδίζει συνεχώς έδαφος η κοινή αίσθηση ότι η \"Θεωρία των ηθικών συναισθημάτων\" αποτελεί ένα από τα σημαντικότερα βιβλία ηθικής φιλοσοφίας.",
                Category = "Κοινωνιολογία",
                Author = "Smith Adam",
                Pages = 524,
                Publisher = "Εκδόσεις Παπαζήση",
                YearPublished = 2012,
                ISBN = "9789600225884",
                BasePrice = 25.09,
                Discount = 10.0
            });

            this.Data.Add(new Book()
            {
                Cover = Properties.Resources.book_3,
                Title = "Θεωρίες κοινωνικών συστημάτων",
                Summary = "Το ανά χείρας έργο έχει έναν πολύ απλό, αλλά συνάμα δύσκολο στόχο: να συνενώσει τρεις διαφορετικές κοινωνικές θεωρίες υπό μία ενιαία αφηγηματική συνέχεια. Οι θεωρίες των Parsons, Luhmann και Habermas αξιοποιούν και οι τρεις τη μεθοδολογική παράδοση του λειτουργισμού και συγκροτούν μαζί μια ειδικότερη επιστημολογική παράδοση η οποία χαρακτηρίζεται από την κατανόηση και την ερμηνεία των κοινωνικών σχέσεων υπό τη μορφή συστήματος.",
                Category = "Κοινωνιολογία",
                Author = "Μαγκλάρας Βασίλης",
                Pages = 317,
                Publisher = "Εκδόσεις Ι. Σιδέρης",
                YearPublished = 2013,
                ISBN = "9789600806397",
                BasePrice = 14.33,
                Discount = 20.0
            });

            this.Data.Add(new Book()
            {
                Cover = Properties.Resources.book_4,
                Title = "Ζωή δίχως συνταγές",
                Summary = "Οι αληθινές σχέσεις ανατρέπονται. Παίζονται κάθε μέρα κορώνα-γράμματα. Μάθε να γράφεις και να σβήνεις συνεχώς την ιστορία της ζωής σου, δίχως να φοβάσαι τις μουντζούρες και τα λάθη. Να έχει ο άλλος την ανάγκη να γείρει πάνω σου γιατί σε αγάπησε και όχι γιατί ψάχνει κάπου να στηριχτεί. Είναι στιγμές που δεν σου φτάνει το οξυγόνο. Δεν αρκούν οι δυνάμεις σου. Θέλεις ένα φιλί ζωής. Τότε κάπου αρχίζει η σχέση με τον Θεό.",
                Category = "Φιλοσοφία",
                Author = "Παπαδόπουλος Χαράλαμπος",
                Pages = 208,
                Publisher = "Αρμός",
                YearPublished = 2018,
                ISBN = "9789606151446",
                BasePrice = 9.90,
                Discount = 0.0
            });

            this.Data.Add(new Book()
            {
                Cover = Properties.Resources.book_5,
                Title = "Καλώς άρχειν και άρχεσθαι",
                Summary = "Μέσα από το «Καλώς άρχειν και άρχεσθαι» ο Στέλιος Ράμφος ερμηνεύει τα Πολιτικά του Αριστοτέλους. Τα Πολιτικά μιλούν για πολίτευμα και όχι για συνάθροιση. Πολίτευμα είναι ένας τρόπος κυριαρχίας του λόγου σε συγκεκριμένο πληθυσμό. Χωρίς πολίτευμα, χωρίς ανώτερο τελικό σκοπό δεν έχουμε πόλη. Η πόλις είναι ανθρώπινο δημιούργημα με σκοπό ένα αγαθό: Την ειρηνική συνύπαρξη και προκοπή των ανθρώπων.",
                Category = "Φιλοσοφία",
                Author = "Ράμφος Στέλιος",
                Pages = 208,
                Publisher = "Αρμός",
                YearPublished = 2017,
                ISBN = "9789606150654",
                BasePrice = 10.50,
                Discount = 30.0
            });

            this.Data.Add(new Book()
            {
                Cover = Properties.Resources.book_6,
                Title = "Η φιλοσοφία με απλά λόγια",
                Summary = "Πώς δημιουργήθηκε το σύμπαν; Τι είναι η αλήθεια; Πώς μπορούμε να ζήσουμε μια ενάρετη ζωή; Από την αυγή της Ιστορίας, ο άνθρωπος διατυπώνει τέτοια σημαντικά ερωτήματα, καθώς και άλλα σχετικά με τη φύση της ζωής και την ύπαρξη –και οι μεγάλοι στοχαστές προτείνουν απαντήσεις που διαμορφώνουν διαρκώς τον κόσμο μας. Γραμμένο με απλή και κατανοητή γλώσσα, το βιβλίο αυτό είναι γεμάτο συνοπτικές αλλά πλήρεις και απόλυτα κατανοητές εξηγήσεις, διαγράμματα που εξηγούν βήμα προς βήμα τις περίπλοκες θεωρίες, κλασικά αξιομνημόνευτα φιλοσοφικά αποφθέγματα, και επιπλέον είναι εμπλουτισμένο με έξυπνη εικονογράφηση που σκιαγραφεί με πνευματώδη τρόπο τις απόψεις που έχει ο άνθρωπος για τα μεγάλα φιλοσοφικά ζητήματα. Είτε είστε αρχάριος, είτε ενθουσιώδης σπουδαστής, είτε προχωρημένος μελετητής, Η φιλοσοφία με απλά λόγια θα σας προσφέρει άφθονη πνευματική τροφή.",
                Category = "Φιλοσοφία",
                Author = "Συλλογικό Έργο",
                Pages = 352,
                Publisher = "Κλειδάριθμος",
                YearPublished = 2015,
                ISBN = "9789604616268",
                BasePrice = 18.69,
                Discount = 15.0
            });

            this.Data.Add(new Book()
            {
                Cover = Properties.Resources.book_7,
                Title = "Τι είναι δίκαιο",
                Summary = "Το ερώτημα \"τι είναι δίκαιο;\", που περιέχεται στον τίτλο του βιβλίου, είναι πολύ παλαιό. Απασχολεί τους θεωρητικούς και τους φιλοσόφους του δικαίου από την αρχαιότητα μέχρι σήμερα. Θα μπορούσαμε να πούμε ότι πρόκειται για ένα ερώτημα ανάλογο με εκείνο που απηύθυνε στο Πραιτώριο ο Πόντιος Πιλάτος προς τον Ιησού Χριστό: \"Τι εστίν αλήθεια;\" Ωστόσο, με το παρόν βιβλίο δεν επιδιώκεται η συνέχιση της αναζήτησης μιας απάντησης, η οποία ίσως και να μην υπάρχει.",
                Category = "Δίκαιο",
                Author = "Γεωργιάδης Απόστολος Σ.",
                Pages = 646,
                Publisher = "Πανεπιστημιακές Εκδόσεις Κρήτης",
                YearPublished = 2018,
                ISBN = "9789605245085",
                BasePrice = 31.50,
                Discount = 0.0
            });

            this.Data.Add(new Book()
            {
                Cover = Properties.Resources.book_8,
                Title = "Εισαγωγή στη νομική πληροφορική",
                Summary = "Το έργο «Εισαγωγή στη Νομική Πληροφορική» επιχειρεί μια πρώτη προσέγγιση της σχέσης του Δικαίου με την Κοινωνία της Πληροφορίας και τις νέες τεχνολογίες. Με κεντρικό άξονα την «πληροφορία», ως έννομο αγαθό, ο συγγραφέας οριοθετεί με επιτυχία τις μεθοδολογικές παραμέτρους του γνωστικού αντικειμένου της Νομικής Πληροφορικής, διαγράφοντας με σαφήνεια το ρόλο και τη λειτουργία που αναπτύσσει καθεμιά από αυτές, στο πλαίσιο της μεταξύ τους αλληλεπίδρασης. Μέσα από την ανάλυσή του, επιχειρεί να αποδυναμώσει τον κίνδυνο υπερίσχυσης της τεχνολογικής παραμέτρου έναντι του δικαίου, προσφέροντας μια εναλλακτική προσέγγιση για τη βελτιστοποίηση της λειτουργίας του τελευταίου.",
                Category = "Δίκαιο",
                Author = "Γιαννόπουλος Γιώργος Ν.",
                Pages = 288,
                Publisher = "Νομική Βιβλιοθήκη",
                YearPublished = 2018,
                ISBN = "9789606221286",
                BasePrice = 27.0,
                Discount = 0.0
            });

            this.Data.Add(new Book()
            {
                Cover = Properties.Resources.book_9,
                Title = "ΜΜΕ",
                Summary = "Συχνά λέγεται ότι ζούμε την \"επανάσταση της πληροφορίας\". Πράγματι, τα τελευταία χρόνια υπήρξαν πολύ σημαντικές εξελίξεις στα μέσα μαζικής ενημέρωσης. Χάρη στην καλωδιακή, τη δορυφορική και την ψηφιακή τεχνολογία είναι πια εφικτή η πρόσβαση σε κάθε είδους πληροφορία.",
                Category = "Δίκαιο",
                Author = "Petley Julian",
                Pages = 64,
                Publisher = "Σαββάλας",
                YearPublished = 2004,
                ISBN = "9789604231997",
                BasePrice = 14.5,
                Discount = 23.0
            });

            this.Data.Add(new Book()
            {
                Cover = Properties.Resources.book_10,
                Title = "Τα ροκ ημερολόγια",
                Summary = "Τα Ροκ Ημερολόγια θα μπορούσαν να εκληφθούν ως ένας τόμος \"προφορικής ιστορίας\" και συλλογή φωτογραφικών τεκμηρίων, που παρέχει στον σημερινό αναγνώστη σημαντικές πληροφορίες για τις νεανικές υποκουλτούρες στην Ελλάδα, στις αρχές της δεκαετίας του 80'.Φρικιά, μεταλλάδες, χούλιγκανς, πανκιά, ντισκόβιοι-καρεκλάδες, νιουγουεηβάδες.",
                Category = "Μουσική",
                Author = "Τουρκοβασίλης Γιώργος",
                Pages = 192,
                Publisher = "Στο Περιθώριο",
                YearPublished = 2016,
                ISBN = "9786188141612",
                BasePrice = 8.16,
                Discount = 0.0
            });
        }

        private void InitializeAutoCompleteTerms()
        {
            this.AutoCompleteTerms = new AutoCompleteStringCollection();

            var titles = from Book book in this.Data select book.Title;
            var categories = from Book book in this.Data select book.Category;
            var authors = from Book book in this.Data select book.Author;
            var publishers = from Book book in this.Data select book.Publisher;

            this.AutoCompleteTerms.AddRange(titles.ToArray());
            this.AutoCompleteTerms.AddRange(categories.ToArray());
            this.AutoCompleteTerms.AddRange(authors.ToArray());
            this.AutoCompleteTerms.AddRange(publishers.ToArray());
        }
    }
}
